# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

def maximum(a,b,c):
    return max(a,b,c)

print(maximum(3,4,5))