import re
name = input('Name:')
surname = input('Surname:')
email = input('email:')
pattern1 = '[A-Z][A-z]*'
pattern2 = '[0-9_A-z]+@[a-z]+\.(com|ru|org)'
if not re.match(pattern1, name):
    print('Invalid input!')
elif not re.match(pattern1, surname):
    print('Invalid input!')
elif not re.match(pattern2, email):
    print('Invalid input!')
else:
    print('Correct!=)')


# Задача - 2:
# Вам дан текст:

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!

pattern3 = '\.\.'
found = re.findall(pattern3, some_str)
if found == []:
    print('Нет совпадений!')
else:
    print('Элемент найден в тексте')

